{
  "backend/main.mo": "Empty actor with no backend logic or persistence.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global styles defining color variables and themes for the app.",
  "frontend/index.html": "HTML entry with root element and page title set to Valentine Interactive.",
  "frontend/README.md": "Developer guide explaining how to change the browser tab title by editing frontend/index.html.",
  "frontend/src/App.tsx": "Wraps the ValentinePage component with a light-only ThemeProvider.",
  "frontend/src/components/FloatingElement.tsx": "Animated floating image component with sway and blossom effects and load error handling.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright text and caffeine.ai attribution with a pulsing heart icon.",
  "frontend/src/components/SparkleBurst.tsx": "Creates an 8-sparkle radial burst animation at a given screen position.",
  "frontend/src/components/SuccessModal.tsx": "Success modal displaying a floral message with falling tulip and lily confetti animations.",
  "frontend/src/hooks/useActor.ts": "Initializes a backend actor using the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder since no backend queries are required.",
  "frontend/src/index.css": "Defines Tailwind layers plus extensive OKLCH variables for light/dark Valentine themes and custom utility classes/animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, importing global styles.",
  "frontend/src/pages/ValentinePage.tsx": "Implements the animated Valentine interaction page with background loading, floating elements, music toggle, and Yes/No branching effects.",
  "frontend/src/utils/assetDiagnostics.ts": "Checks critical image assets by attempting to load them and logs successes or failures for deployment validation.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color variables, animations, container settings, and plugins.",
  "project_state.json": "Stores project metadata, requirements, known issues, and feature-tracking state for the interactive Valentine flow."
}